#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Sun Oct 15 17:45:57 2023

@author: yuexiang
"""



import numpy as np

# 原始数据
data = np.array([3.293331077,-0.0966629,-0.163492094,0.318962382,-0.000573935,-0.302396372,-1.034707386,0.485476721,1.335718943,0.903956679,1.141815229,-0.012983797,-0.549861452,-1.079233074,-1.102176751,0.71999992,-0.67875571,-0.911167381,-0.306252873,-0.679493591,0.238242562,-0.18696445,-0.969110114,-0.734895454,0.371223824])


# 找到原始数据的最小值和最大值
min_value = np.min(data)
max_value = np.max(data)

# 计算缩放因子
a = (100 - 50) / (max_value - min_value)

# 进行线性变换，将数据映射到 50 到 100 的范围
mapped_data = a * (data - min_value) + 50

# 打印映射后的数据
print(mapped_data)
